layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_train_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
}
layer {
  name: "slice2a"
  type: "Slice"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b_sp0"
  top: "res2a_branch2b_sp1"
  top: "res2a_branch2b_sp2"
  top: "res2a_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 26
    slice_point: 52
    slice_point: 78
  }
}
layer {
  name: "res2a_branch2b1"
  type: "Convolution"
  bottom: "res2a_branch2b_sp0"
  top: "res2a_branch2b1"
  convolution_param {
    num_output: 26
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2a_branch2b1"
  type: "BatchNorm"
  bottom: "res2a_branch2b1"
  top: "res2a_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2b1"
  type: "Scale"
  bottom: "res2a_branch2b1"
  top: "res2a_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b1_relu"
  type: "ReLU"
  bottom: "res2a_branch2b1"
  top: "res2a_branch2b1"
}
layer {
  name: "res2a_branch2b2"
  type: "Convolution"
  bottom: "res2a_branch2b_sp1"
  top: "res2a_branch2b2"
  convolution_param {
    num_output: 26
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2a_branch2b2"
  type: "BatchNorm"
  bottom: "res2a_branch2b2"
  top: "res2a_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2b2"
  type: "Scale"
  bottom: "res2a_branch2b2"
  top: "res2a_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b2_relu"
  type: "ReLU"
  bottom: "res2a_branch2b2"
  top: "res2a_branch2b2"
}
layer {
  name: "concat2aout0_1"
  type: "Concat"
  bottom: "res2a_branch2b1"
  bottom: "res2a_branch2b2"
  top: "concat2aout0_1"
}
layer {
  name: "res2a_branch2b3"
  type: "Convolution"
  bottom: "res2a_branch2b_sp2"
  top: "res2a_branch2b3"
  convolution_param {
    num_output: 26
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2a_branch2b3"
  type: "BatchNorm"
  bottom: "res2a_branch2b3"
  top: "res2a_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2b3"
  type: "Scale"
  bottom: "res2a_branch2b3"
  top: "res2a_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b3_relu"
  type: "ReLU"
  bottom: "res2a_branch2b3"
  top: "res2a_branch2b3"
}
layer {
  name: "concat2aout0_1_2"
  type: "Concat"
  bottom: "concat2aout0_1"
  bottom: "res2a_branch2b3"
  top: "concat2aout0_1_2"
}
layer {
  name: "pool2a_branch2b"
  type: "Pooling"
  bottom: "res2a_branch2b_sp3"
  top: "pool2a_branch2b"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "concat2aout0_1_2_3"
  type: "Concat"
  bottom: "concat2aout0_1_2"
  bottom: "pool2a_branch2b"
  top: "concat2aout0_1_2_3"
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "concat2aout0_1_2_3"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2c"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
}
layer {
  name: "slice2b"
  type: "Slice"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b_sp0"
  top: "res2b_branch2b_sp1"
  top: "res2b_branch2b_sp2"
  top: "res2b_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 26
    slice_point: 52
    slice_point: 78
  }
}
layer {
  name: "res2b_branch2b1"
  type: "Convolution"
  bottom: "res2b_branch2b_sp0"
  top: "res2b_branch2b1"
  convolution_param {
    num_output: 26
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2b_branch2b1"
  type: "BatchNorm"
  bottom: "res2b_branch2b1"
  top: "res2b_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2b1"
  type: "Scale"
  bottom: "res2b_branch2b1"
  top: "res2b_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b1_relu"
  type: "ReLU"
  bottom: "res2b_branch2b1"
  top: "res2b_branch2b1"
}
layer {
  name: "res2b_branch2b_sp0_1"
  type: "Eltwise"
  bottom: "res2b_branch2b1"
  bottom: "res2b_branch2b_sp1"
  top: "res2b_branch2b_sp0_1"
}
layer {
  name: "res2b_branch2b2"
  type: "Convolution"
  bottom: "res2b_branch2b_sp0_1"
  top: "res2b_branch2b2"
  convolution_param {
    num_output: 26
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2b_branch2b2"
  type: "BatchNorm"
  bottom: "res2b_branch2b2"
  top: "res2b_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2b2"
  type: "Scale"
  bottom: "res2b_branch2b2"
  top: "res2b_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b2_relu"
  type: "ReLU"
  bottom: "res2b_branch2b2"
  top: "res2b_branch2b2"
}
layer {
  name: "concat2bout0_1"
  type: "Concat"
  bottom: "res2b_branch2b1"
  bottom: "res2b_branch2b2"
  top: "concat2bout0_1"
}
layer {
  name: "res2b_branch2b_sp0_1_2"
  type: "Eltwise"
  bottom: "res2b_branch2b2"
  bottom: "res2b_branch2b_sp2"
  top: "res2b_branch2b_sp0_1_2"
}
layer {
  name: "res2b_branch2b3"
  type: "Convolution"
  bottom: "res2b_branch2b_sp0_1_2"
  top: "res2b_branch2b3"
  convolution_param {
    num_output: 26
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2b_branch2b3"
  type: "BatchNorm"
  bottom: "res2b_branch2b3"
  top: "res2b_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2b3"
  type: "Scale"
  bottom: "res2b_branch2b3"
  top: "res2b_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b3_relu"
  type: "ReLU"
  bottom: "res2b_branch2b3"
  top: "res2b_branch2b3"
}
layer {
  name: "concat2bout0_1_2"
  type: "Concat"
  bottom: "concat2bout0_1"
  bottom: "res2b_branch2b3"
  top: "concat2bout0_1_2"
}
layer {
  name: "concat2bout0_1_2_3"
  type: "Concat"
  bottom: "concat2bout0_1_2"
  bottom: "res2b_branch2b_sp3"
  top: "concat2bout0_1_2_3"
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "concat2bout0_1_2_3"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BatchNorm"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2c"
  type: "Scale"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
}
layer {
  name: "slice2c"
  type: "Slice"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b_sp0"
  top: "res2c_branch2b_sp1"
  top: "res2c_branch2b_sp2"
  top: "res2c_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 26
    slice_point: 52
    slice_point: 78
  }
}
layer {
  name: "res2c_branch2b1"
  type: "Convolution"
  bottom: "res2c_branch2b_sp0"
  top: "res2c_branch2b1"
  convolution_param {
    num_output: 26
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2c_branch2b1"
  type: "BatchNorm"
  bottom: "res2c_branch2b1"
  top: "res2c_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2b1"
  type: "Scale"
  bottom: "res2c_branch2b1"
  top: "res2c_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2b1_relu"
  type: "ReLU"
  bottom: "res2c_branch2b1"
  top: "res2c_branch2b1"
}
layer {
  name: "res2c_branch2b_sp0_1"
  type: "Eltwise"
  bottom: "res2c_branch2b1"
  bottom: "res2c_branch2b_sp1"
  top: "res2c_branch2b_sp0_1"
}
layer {
  name: "res2c_branch2b2"
  type: "Convolution"
  bottom: "res2c_branch2b_sp0_1"
  top: "res2c_branch2b2"
  convolution_param {
    num_output: 26
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2c_branch2b2"
  type: "BatchNorm"
  bottom: "res2c_branch2b2"
  top: "res2c_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2b2"
  type: "Scale"
  bottom: "res2c_branch2b2"
  top: "res2c_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2b2_relu"
  type: "ReLU"
  bottom: "res2c_branch2b2"
  top: "res2c_branch2b2"
}
layer {
  name: "concat2cout0_1"
  type: "Concat"
  bottom: "res2c_branch2b1"
  bottom: "res2c_branch2b2"
  top: "concat2cout0_1"
}
layer {
  name: "res2c_branch2b_sp0_1_2"
  type: "Eltwise"
  bottom: "res2c_branch2b2"
  bottom: "res2c_branch2b_sp2"
  top: "res2c_branch2b_sp0_1_2"
}
layer {
  name: "res2c_branch2b3"
  type: "Convolution"
  bottom: "res2c_branch2b_sp0_1_2"
  top: "res2c_branch2b3"
  convolution_param {
    num_output: 26
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2c_branch2b3"
  type: "BatchNorm"
  bottom: "res2c_branch2b3"
  top: "res2c_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2b3"
  type: "Scale"
  bottom: "res2c_branch2b3"
  top: "res2c_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2b3_relu"
  type: "ReLU"
  bottom: "res2c_branch2b3"
  top: "res2c_branch2b3"
}
layer {
  name: "concat2cout0_1_2"
  type: "Concat"
  bottom: "concat2cout0_1"
  bottom: "res2c_branch2b3"
  top: "concat2cout0_1_2"
}
layer {
  name: "concat2cout0_1_2_3"
  type: "Concat"
  bottom: "concat2cout0_1_2"
  bottom: "res2c_branch2b_sp3"
  top: "concat2cout0_1_2_3"
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "concat2cout0_1_2_3"
  top: "res2c_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2c_branch2c"
  type: "BatchNorm"
  bottom: "res2c_branch2c"
  top: "res2c_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2c"
  type: "Scale"
  bottom: "res2c_branch2c"
  top: "res2c_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c"
  type: "Eltwise"
  bottom: "res2b"
  bottom: "res2c_branch2c"
  top: "res2c"
}
layer {
  name: "res2c_relu"
  type: "ReLU"
  bottom: "res2c"
  top: "res2c"
}
layer {
  name: "res3a_branch2a"
  type: "Convolution"
  bottom: "res2c"
  top: "res3a_branch2a"
  convolution_param {
    num_output: 208
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "bn3a_branch2a"
  type: "BatchNorm"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch2a"
  type: "Scale"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch2a_relu"
  type: "ReLU"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
}
layer {
  name: "slice3a"
  type: "Slice"
  bottom: "res3a_branch2a"
  top: "res3a_branch2b_sp0"
  top: "res3a_branch2b_sp1"
  top: "res3a_branch2b_sp2"
  top: "res3a_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 52
    slice_point: 104
    slice_point: 156
  }
}
layer {
  name: "res3a_branch2b1"
  type: "Convolution"
  bottom: "res3a_branch2b_sp0"
  top: "res3a_branch2b1"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3a_branch2b1"
  type: "BatchNorm"
  bottom: "res3a_branch2b1"
  top: "res3a_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch2b1"
  type: "Scale"
  bottom: "res3a_branch2b1"
  top: "res3a_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch2b1_relu"
  type: "ReLU"
  bottom: "res3a_branch2b1"
  top: "res3a_branch2b1"
}
layer {
  name: "res3a_branch2b2"
  type: "Convolution"
  bottom: "res3a_branch2b_sp1"
  top: "res3a_branch2b2"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3a_branch2b2"
  type: "BatchNorm"
  bottom: "res3a_branch2b2"
  top: "res3a_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch2b2"
  type: "Scale"
  bottom: "res3a_branch2b2"
  top: "res3a_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch2b2_relu"
  type: "ReLU"
  bottom: "res3a_branch2b2"
  top: "res3a_branch2b2"
}
layer {
  name: "concat3aout0_1"
  type: "Concat"
  bottom: "res3a_branch2b1"
  bottom: "res3a_branch2b2"
  top: "concat3aout0_1"
}
layer {
  name: "res3a_branch2b3"
  type: "Convolution"
  bottom: "res3a_branch2b_sp2"
  top: "res3a_branch2b3"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3a_branch2b3"
  type: "BatchNorm"
  bottom: "res3a_branch2b3"
  top: "res3a_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch2b3"
  type: "Scale"
  bottom: "res3a_branch2b3"
  top: "res3a_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch2b3_relu"
  type: "ReLU"
  bottom: "res3a_branch2b3"
  top: "res3a_branch2b3"
}
layer {
  name: "concat3aout0_1_2"
  type: "Concat"
  bottom: "concat3aout0_1"
  bottom: "res3a_branch2b3"
  top: "concat3aout0_1_2"
}
layer {
  name: "pool3a_branch2b"
  type: "Pooling"
  bottom: "res3a_branch2b_sp3"
  top: "pool3a_branch2b"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "concat3aout0_1_2_3"
  type: "Concat"
  bottom: "concat3aout0_1_2"
  bottom: "pool3a_branch2b"
  top: "concat3aout0_1_2_3"
}
layer {
  name: "res3a_branch2c"
  type: "Convolution"
  bottom: "concat3aout0_1_2_3"
  top: "res3a_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3a_branch2c"
  type: "BatchNorm"
  bottom: "res3a_branch2c"
  top: "res3a_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch2c"
  type: "Scale"
  bottom: "res3a_branch2c"
  top: "res3a_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch1"
  type: "Convolution"
  bottom: "res2c"
  top: "res3a_branch1"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "bn3a_branch1"
  type: "BatchNorm"
  bottom: "res3a_branch1"
  top: "res3a_branch1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch1"
  type: "Scale"
  bottom: "res3a_branch1"
  top: "res3a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a"
  type: "Eltwise"
  bottom: "res3a_branch1"
  bottom: "res3a_branch2c"
  top: "res3a"
}
layer {
  name: "res3a_relu"
  type: "ReLU"
  bottom: "res3a"
  top: "res3a"
}
layer {
  name: "res3b1_branch2a"
  type: "Convolution"
  bottom: "res3a"
  top: "res3b1_branch2a"
  convolution_param {
    num_output: 208
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b1_branch2a"
  type: "BatchNorm"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b1_branch2a"
  type: "Scale"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b1_branch2a_relu"
  type: "ReLU"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2a"
}
layer {
  name: "slice3b1"
  type: "Slice"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2b_sp0"
  top: "res3b1_branch2b_sp1"
  top: "res3b1_branch2b_sp2"
  top: "res3b1_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 52
    slice_point: 104
    slice_point: 156
  }
}
layer {
  name: "res3b1_branch2b1"
  type: "Convolution"
  bottom: "res3b1_branch2b_sp0"
  top: "res3b1_branch2b1"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b1_branch2b1"
  type: "BatchNorm"
  bottom: "res3b1_branch2b1"
  top: "res3b1_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b1_branch2b1"
  type: "Scale"
  bottom: "res3b1_branch2b1"
  top: "res3b1_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b1_branch2b1_relu"
  type: "ReLU"
  bottom: "res3b1_branch2b1"
  top: "res3b1_branch2b1"
}
layer {
  name: "res3b1_branch2b_sp0_1"
  type: "Eltwise"
  bottom: "res3b1_branch2b1"
  bottom: "res3b1_branch2b_sp1"
  top: "res3b1_branch2b_sp0_1"
}
layer {
  name: "res3b1_branch2b2"
  type: "Convolution"
  bottom: "res3b1_branch2b_sp0_1"
  top: "res3b1_branch2b2"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b1_branch2b2"
  type: "BatchNorm"
  bottom: "res3b1_branch2b2"
  top: "res3b1_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b1_branch2b2"
  type: "Scale"
  bottom: "res3b1_branch2b2"
  top: "res3b1_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b1_branch2b2_relu"
  type: "ReLU"
  bottom: "res3b1_branch2b2"
  top: "res3b1_branch2b2"
}
layer {
  name: "concat3b1out0_1"
  type: "Concat"
  bottom: "res3b1_branch2b1"
  bottom: "res3b1_branch2b2"
  top: "concat3b1out0_1"
}
layer {
  name: "res3b1_branch2b_sp0_1_2"
  type: "Eltwise"
  bottom: "res3b1_branch2b2"
  bottom: "res3b1_branch2b_sp2"
  top: "res3b1_branch2b_sp0_1_2"
}
layer {
  name: "res3b1_branch2b3"
  type: "Convolution"
  bottom: "res3b1_branch2b_sp0_1_2"
  top: "res3b1_branch2b3"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b1_branch2b3"
  type: "BatchNorm"
  bottom: "res3b1_branch2b3"
  top: "res3b1_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b1_branch2b3"
  type: "Scale"
  bottom: "res3b1_branch2b3"
  top: "res3b1_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b1_branch2b3_relu"
  type: "ReLU"
  bottom: "res3b1_branch2b3"
  top: "res3b1_branch2b3"
}
layer {
  name: "concat3b1out0_1_2"
  type: "Concat"
  bottom: "concat3b1out0_1"
  bottom: "res3b1_branch2b3"
  top: "concat3b1out0_1_2"
}
layer {
  name: "concat3b1out0_1_2_3"
  type: "Concat"
  bottom: "concat3b1out0_1_2"
  bottom: "res3b1_branch2b_sp3"
  top: "concat3b1out0_1_2_3"
}
layer {
  name: "res3b1_branch2c"
  type: "Convolution"
  bottom: "concat3b1out0_1_2_3"
  top: "res3b1_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b1_branch2c"
  type: "BatchNorm"
  bottom: "res3b1_branch2c"
  top: "res3b1_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b1_branch2c"
  type: "Scale"
  bottom: "res3b1_branch2c"
  top: "res3b1_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b1"
  type: "Eltwise"
  bottom: "res3a"
  bottom: "res3b1_branch2c"
  top: "res3b1"
}
layer {
  name: "res3b1_relu"
  type: "ReLU"
  bottom: "res3b1"
  top: "res3b1"
}
layer {
  name: "res3b2_branch2a"
  type: "Convolution"
  bottom: "res3b1"
  top: "res3b2_branch2a"
  convolution_param {
    num_output: 208
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b2_branch2a"
  type: "BatchNorm"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b2_branch2a"
  type: "Scale"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b2_branch2a_relu"
  type: "ReLU"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2a"
}
layer {
  name: "slice3b2"
  type: "Slice"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2b_sp0"
  top: "res3b2_branch2b_sp1"
  top: "res3b2_branch2b_sp2"
  top: "res3b2_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 52
    slice_point: 104
    slice_point: 156
  }
}
layer {
  name: "res3b2_branch2b1"
  type: "Convolution"
  bottom: "res3b2_branch2b_sp0"
  top: "res3b2_branch2b1"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b2_branch2b1"
  type: "BatchNorm"
  bottom: "res3b2_branch2b1"
  top: "res3b2_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b2_branch2b1"
  type: "Scale"
  bottom: "res3b2_branch2b1"
  top: "res3b2_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b2_branch2b1_relu"
  type: "ReLU"
  bottom: "res3b2_branch2b1"
  top: "res3b2_branch2b1"
}
layer {
  name: "res3b2_branch2b_sp0_1"
  type: "Eltwise"
  bottom: "res3b2_branch2b1"
  bottom: "res3b2_branch2b_sp1"
  top: "res3b2_branch2b_sp0_1"
}
layer {
  name: "res3b2_branch2b2"
  type: "Convolution"
  bottom: "res3b2_branch2b_sp0_1"
  top: "res3b2_branch2b2"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b2_branch2b2"
  type: "BatchNorm"
  bottom: "res3b2_branch2b2"
  top: "res3b2_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b2_branch2b2"
  type: "Scale"
  bottom: "res3b2_branch2b2"
  top: "res3b2_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b2_branch2b2_relu"
  type: "ReLU"
  bottom: "res3b2_branch2b2"
  top: "res3b2_branch2b2"
}
layer {
  name: "concat3b2out0_1"
  type: "Concat"
  bottom: "res3b2_branch2b1"
  bottom: "res3b2_branch2b2"
  top: "concat3b2out0_1"
}
layer {
  name: "res3b2_branch2b_sp0_1_2"
  type: "Eltwise"
  bottom: "res3b2_branch2b2"
  bottom: "res3b2_branch2b_sp2"
  top: "res3b2_branch2b_sp0_1_2"
}
layer {
  name: "res3b2_branch2b3"
  type: "Convolution"
  bottom: "res3b2_branch2b_sp0_1_2"
  top: "res3b2_branch2b3"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b2_branch2b3"
  type: "BatchNorm"
  bottom: "res3b2_branch2b3"
  top: "res3b2_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b2_branch2b3"
  type: "Scale"
  bottom: "res3b2_branch2b3"
  top: "res3b2_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b2_branch2b3_relu"
  type: "ReLU"
  bottom: "res3b2_branch2b3"
  top: "res3b2_branch2b3"
}
layer {
  name: "concat3b2out0_1_2"
  type: "Concat"
  bottom: "concat3b2out0_1"
  bottom: "res3b2_branch2b3"
  top: "concat3b2out0_1_2"
}
layer {
  name: "concat3b2out0_1_2_3"
  type: "Concat"
  bottom: "concat3b2out0_1_2"
  bottom: "res3b2_branch2b_sp3"
  top: "concat3b2out0_1_2_3"
}
layer {
  name: "res3b2_branch2c"
  type: "Convolution"
  bottom: "concat3b2out0_1_2_3"
  top: "res3b2_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b2_branch2c"
  type: "BatchNorm"
  bottom: "res3b2_branch2c"
  top: "res3b2_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b2_branch2c"
  type: "Scale"
  bottom: "res3b2_branch2c"
  top: "res3b2_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b2"
  type: "Eltwise"
  bottom: "res3b1"
  bottom: "res3b2_branch2c"
  top: "res3b2"
}
layer {
  name: "res3b2_relu"
  type: "ReLU"
  bottom: "res3b2"
  top: "res3b2"
}
layer {
  name: "res3b3_branch2a"
  type: "Convolution"
  bottom: "res3b2"
  top: "res3b3_branch2a"
  convolution_param {
    num_output: 208
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b3_branch2a"
  type: "BatchNorm"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b3_branch2a"
  type: "Scale"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b3_branch2a_relu"
  type: "ReLU"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2a"
}
layer {
  name: "slice3b3"
  type: "Slice"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2b_sp0"
  top: "res3b3_branch2b_sp1"
  top: "res3b3_branch2b_sp2"
  top: "res3b3_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 52
    slice_point: 104
    slice_point: 156
  }
}
layer {
  name: "res3b3_branch2b1"
  type: "Convolution"
  bottom: "res3b3_branch2b_sp0"
  top: "res3b3_branch2b1"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b3_branch2b1"
  type: "BatchNorm"
  bottom: "res3b3_branch2b1"
  top: "res3b3_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b3_branch2b1"
  type: "Scale"
  bottom: "res3b3_branch2b1"
  top: "res3b3_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b3_branch2b1_relu"
  type: "ReLU"
  bottom: "res3b3_branch2b1"
  top: "res3b3_branch2b1"
}
layer {
  name: "res3b3_branch2b_sp0_1"
  type: "Eltwise"
  bottom: "res3b3_branch2b1"
  bottom: "res3b3_branch2b_sp1"
  top: "res3b3_branch2b_sp0_1"
}
layer {
  name: "res3b3_branch2b2"
  type: "Convolution"
  bottom: "res3b3_branch2b_sp0_1"
  top: "res3b3_branch2b2"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b3_branch2b2"
  type: "BatchNorm"
  bottom: "res3b3_branch2b2"
  top: "res3b3_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b3_branch2b2"
  type: "Scale"
  bottom: "res3b3_branch2b2"
  top: "res3b3_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b3_branch2b2_relu"
  type: "ReLU"
  bottom: "res3b3_branch2b2"
  top: "res3b3_branch2b2"
}
layer {
  name: "concat3b3out0_1"
  type: "Concat"
  bottom: "res3b3_branch2b1"
  bottom: "res3b3_branch2b2"
  top: "concat3b3out0_1"
}
layer {
  name: "res3b3_branch2b_sp0_1_2"
  type: "Eltwise"
  bottom: "res3b3_branch2b2"
  bottom: "res3b3_branch2b_sp2"
  top: "res3b3_branch2b_sp0_1_2"
}
layer {
  name: "res3b3_branch2b3"
  type: "Convolution"
  bottom: "res3b3_branch2b_sp0_1_2"
  top: "res3b3_branch2b3"
  convolution_param {
    num_output: 52
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b3_branch2b3"
  type: "BatchNorm"
  bottom: "res3b3_branch2b3"
  top: "res3b3_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b3_branch2b3"
  type: "Scale"
  bottom: "res3b3_branch2b3"
  top: "res3b3_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b3_branch2b3_relu"
  type: "ReLU"
  bottom: "res3b3_branch2b3"
  top: "res3b3_branch2b3"
}
layer {
  name: "concat3b3out0_1_2"
  type: "Concat"
  bottom: "concat3b3out0_1"
  bottom: "res3b3_branch2b3"
  top: "concat3b3out0_1_2"
}
layer {
  name: "concat3b3out0_1_2_3"
  type: "Concat"
  bottom: "concat3b3out0_1_2"
  bottom: "res3b3_branch2b_sp3"
  top: "concat3b3out0_1_2_3"
}
layer {
  name: "res3b3_branch2c"
  type: "Convolution"
  bottom: "concat3b3out0_1_2_3"
  top: "res3b3_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b3_branch2c"
  type: "BatchNorm"
  bottom: "res3b3_branch2c"
  top: "res3b3_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b3_branch2c"
  type: "Scale"
  bottom: "res3b3_branch2c"
  top: "res3b3_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b3"
  type: "Eltwise"
  bottom: "res3b2"
  bottom: "res3b3_branch2c"
  top: "res3b3"
}
layer {
  name: "res3b3_relu"
  type: "ReLU"
  bottom: "res3b3"
  top: "res3b3"
}
layer {
  name: "res4a_branch2a"
  type: "Convolution"
  bottom: "res3b3"
  top: "res4a_branch2a"
  convolution_param {
    num_output: 416
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "bn4a_branch2a"
  type: "BatchNorm"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4a_branch2a"
  type: "Scale"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4a_branch2a_relu"
  type: "ReLU"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
}
layer {
  name: "slice4a"
  type: "Slice"
  bottom: "res4a_branch2a"
  top: "res4a_branch2b_sp0"
  top: "res4a_branch2b_sp1"
  top: "res4a_branch2b_sp2"
  top: "res4a_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 104
    slice_point: 208
    slice_point: 312
  }
}
layer {
  name: "res4a_branch2b1"
  type: "Convolution"
  bottom: "res4a_branch2b_sp0"
  top: "res4a_branch2b1"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4a_branch2b1"
  type: "BatchNorm"
  bottom: "res4a_branch2b1"
  top: "res4a_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4a_branch2b1"
  type: "Scale"
  bottom: "res4a_branch2b1"
  top: "res4a_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4a_branch2b1_relu"
  type: "ReLU"
  bottom: "res4a_branch2b1"
  top: "res4a_branch2b1"
}
layer {
  name: "res4a_branch2b2"
  type: "Convolution"
  bottom: "res4a_branch2b_sp1"
  top: "res4a_branch2b2"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4a_branch2b2"
  type: "BatchNorm"
  bottom: "res4a_branch2b2"
  top: "res4a_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4a_branch2b2"
  type: "Scale"
  bottom: "res4a_branch2b2"
  top: "res4a_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4a_branch2b2_relu"
  type: "ReLU"
  bottom: "res4a_branch2b2"
  top: "res4a_branch2b2"
}
layer {
  name: "concat4aout0_1"
  type: "Concat"
  bottom: "res4a_branch2b1"
  bottom: "res4a_branch2b2"
  top: "concat4aout0_1"
}
layer {
  name: "res4a_branch2b3"
  type: "Convolution"
  bottom: "res4a_branch2b_sp2"
  top: "res4a_branch2b3"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4a_branch2b3"
  type: "BatchNorm"
  bottom: "res4a_branch2b3"
  top: "res4a_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4a_branch2b3"
  type: "Scale"
  bottom: "res4a_branch2b3"
  top: "res4a_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4a_branch2b3_relu"
  type: "ReLU"
  bottom: "res4a_branch2b3"
  top: "res4a_branch2b3"
}
layer {
  name: "concat4aout0_1_2"
  type: "Concat"
  bottom: "concat4aout0_1"
  bottom: "res4a_branch2b3"
  top: "concat4aout0_1_2"
}
layer {
  name: "pool4a_branch2b"
  type: "Pooling"
  bottom: "res4a_branch2b_sp3"
  top: "pool4a_branch2b"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "concat4aout0_1_2_3"
  type: "Concat"
  bottom: "concat4aout0_1_2"
  bottom: "pool4a_branch2b"
  top: "concat4aout0_1_2_3"
}
layer {
  name: "res4a_branch2c"
  type: "Convolution"
  bottom: "concat4aout0_1_2_3"
  top: "res4a_branch2c"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn4a_branch2c"
  type: "BatchNorm"
  bottom: "res4a_branch2c"
  top: "res4a_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4a_branch2c"
  type: "Scale"
  bottom: "res4a_branch2c"
  top: "res4a_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4a_branch1"
  type: "Convolution"
  bottom: "res3b3"
  top: "res4a_branch1"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "bn4a_branch1"
  type: "BatchNorm"
  bottom: "res4a_branch1"
  top: "res4a_branch1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4a_branch1"
  type: "Scale"
  bottom: "res4a_branch1"
  top: "res4a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4a"
  type: "Eltwise"
  bottom: "res4a_branch1"
  bottom: "res4a_branch2c"
  top: "res4a"
}
layer {
  name: "res4a_relu"
  type: "ReLU"
  bottom: "res4a"
  top: "res4a"
}
layer {
  name: "res4b1_branch2a"
  type: "Convolution"
  bottom: "res4a"
  top: "res4b1_branch2a"
  convolution_param {
    num_output: 416
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn4b1_branch2a"
  type: "BatchNorm"
  bottom: "res4b1_branch2a"
  top: "res4b1_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b1_branch2a"
  type: "Scale"
  bottom: "res4b1_branch2a"
  top: "res4b1_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b1_branch2a_relu"
  type: "ReLU"
  bottom: "res4b1_branch2a"
  top: "res4b1_branch2a"
}
layer {
  name: "slice4b1"
  type: "Slice"
  bottom: "res4b1_branch2a"
  top: "res4b1_branch2b_sp0"
  top: "res4b1_branch2b_sp1"
  top: "res4b1_branch2b_sp2"
  top: "res4b1_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 104
    slice_point: 208
    slice_point: 312
  }
}
layer {
  name: "res4b1_branch2b1"
  type: "Convolution"
  bottom: "res4b1_branch2b_sp0"
  top: "res4b1_branch2b1"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4b1_branch2b1"
  type: "BatchNorm"
  bottom: "res4b1_branch2b1"
  top: "res4b1_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b1_branch2b1"
  type: "Scale"
  bottom: "res4b1_branch2b1"
  top: "res4b1_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b1_branch2b1_relu"
  type: "ReLU"
  bottom: "res4b1_branch2b1"
  top: "res4b1_branch2b1"
}
layer {
  name: "res4b1_branch2b_sp0_1"
  type: "Eltwise"
  bottom: "res4b1_branch2b1"
  bottom: "res4b1_branch2b_sp1"
  top: "res4b1_branch2b_sp0_1"
}
layer {
  name: "res4b1_branch2b2"
  type: "Convolution"
  bottom: "res4b1_branch2b_sp0_1"
  top: "res4b1_branch2b2"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4b1_branch2b2"
  type: "BatchNorm"
  bottom: "res4b1_branch2b2"
  top: "res4b1_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b1_branch2b2"
  type: "Scale"
  bottom: "res4b1_branch2b2"
  top: "res4b1_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b1_branch2b2_relu"
  type: "ReLU"
  bottom: "res4b1_branch2b2"
  top: "res4b1_branch2b2"
}
layer {
  name: "concat4b1out0_1"
  type: "Concat"
  bottom: "res4b1_branch2b1"
  bottom: "res4b1_branch2b2"
  top: "concat4b1out0_1"
}
layer {
  name: "res4b1_branch2b_sp0_1_2"
  type: "Eltwise"
  bottom: "res4b1_branch2b2"
  bottom: "res4b1_branch2b_sp2"
  top: "res4b1_branch2b_sp0_1_2"
}
layer {
  name: "res4b1_branch2b3"
  type: "Convolution"
  bottom: "res4b1_branch2b_sp0_1_2"
  top: "res4b1_branch2b3"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4b1_branch2b3"
  type: "BatchNorm"
  bottom: "res4b1_branch2b3"
  top: "res4b1_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b1_branch2b3"
  type: "Scale"
  bottom: "res4b1_branch2b3"
  top: "res4b1_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b1_branch2b3_relu"
  type: "ReLU"
  bottom: "res4b1_branch2b3"
  top: "res4b1_branch2b3"
}
layer {
  name: "concat4b1out0_1_2"
  type: "Concat"
  bottom: "concat4b1out0_1"
  bottom: "res4b1_branch2b3"
  top: "concat4b1out0_1_2"
}
layer {
  name: "concat4b1out0_1_2_3"
  type: "Concat"
  bottom: "concat4b1out0_1_2"
  bottom: "res4b1_branch2b_sp3"
  top: "concat4b1out0_1_2_3"
}
layer {
  name: "res4b1_branch2c"
  type: "Convolution"
  bottom: "concat4b1out0_1_2_3"
  top: "res4b1_branch2c"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn4b1_branch2c"
  type: "BatchNorm"
  bottom: "res4b1_branch2c"
  top: "res4b1_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b1_branch2c"
  type: "Scale"
  bottom: "res4b1_branch2c"
  top: "res4b1_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b1"
  type: "Eltwise"
  bottom: "res4a"
  bottom: "res4b1_branch2c"
  top: "res4b1"
}
layer {
  name: "res4b1_relu"
  type: "ReLU"
  bottom: "res4b1"
  top: "res4b1"
}
layer {
  name: "res4b2_branch2a"
  type: "Convolution"
  bottom: "res4b1"
  top: "res4b2_branch2a"
  convolution_param {
    num_output: 416
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn4b2_branch2a"
  type: "BatchNorm"
  bottom: "res4b2_branch2a"
  top: "res4b2_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b2_branch2a"
  type: "Scale"
  bottom: "res4b2_branch2a"
  top: "res4b2_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b2_branch2a_relu"
  type: "ReLU"
  bottom: "res4b2_branch2a"
  top: "res4b2_branch2a"
}
layer {
  name: "slice4b2"
  type: "Slice"
  bottom: "res4b2_branch2a"
  top: "res4b2_branch2b_sp0"
  top: "res4b2_branch2b_sp1"
  top: "res4b2_branch2b_sp2"
  top: "res4b2_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 104
    slice_point: 208
    slice_point: 312
  }
}
layer {
  name: "res4b2_branch2b1"
  type: "Convolution"
  bottom: "res4b2_branch2b_sp0"
  top: "res4b2_branch2b1"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4b2_branch2b1"
  type: "BatchNorm"
  bottom: "res4b2_branch2b1"
  top: "res4b2_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b2_branch2b1"
  type: "Scale"
  bottom: "res4b2_branch2b1"
  top: "res4b2_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b2_branch2b1_relu"
  type: "ReLU"
  bottom: "res4b2_branch2b1"
  top: "res4b2_branch2b1"
}
layer {
  name: "res4b2_branch2b_sp0_1"
  type: "Eltwise"
  bottom: "res4b2_branch2b1"
  bottom: "res4b2_branch2b_sp1"
  top: "res4b2_branch2b_sp0_1"
}
layer {
  name: "res4b2_branch2b2"
  type: "Convolution"
  bottom: "res4b2_branch2b_sp0_1"
  top: "res4b2_branch2b2"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4b2_branch2b2"
  type: "BatchNorm"
  bottom: "res4b2_branch2b2"
  top: "res4b2_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b2_branch2b2"
  type: "Scale"
  bottom: "res4b2_branch2b2"
  top: "res4b2_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b2_branch2b2_relu"
  type: "ReLU"
  bottom: "res4b2_branch2b2"
  top: "res4b2_branch2b2"
}
layer {
  name: "concat4b2out0_1"
  type: "Concat"
  bottom: "res4b2_branch2b1"
  bottom: "res4b2_branch2b2"
  top: "concat4b2out0_1"
}
layer {
  name: "res4b2_branch2b_sp0_1_2"
  type: "Eltwise"
  bottom: "res4b2_branch2b2"
  bottom: "res4b2_branch2b_sp2"
  top: "res4b2_branch2b_sp0_1_2"
}
layer {
  name: "res4b2_branch2b3"
  type: "Convolution"
  bottom: "res4b2_branch2b_sp0_1_2"
  top: "res4b2_branch2b3"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4b2_branch2b3"
  type: "BatchNorm"
  bottom: "res4b2_branch2b3"
  top: "res4b2_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b2_branch2b3"
  type: "Scale"
  bottom: "res4b2_branch2b3"
  top: "res4b2_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b2_branch2b3_relu"
  type: "ReLU"
  bottom: "res4b2_branch2b3"
  top: "res4b2_branch2b3"
}
layer {
  name: "concat4b2out0_1_2"
  type: "Concat"
  bottom: "concat4b2out0_1"
  bottom: "res4b2_branch2b3"
  top: "concat4b2out0_1_2"
}
layer {
  name: "concat4b2out0_1_2_3"
  type: "Concat"
  bottom: "concat4b2out0_1_2"
  bottom: "res4b2_branch2b_sp3"
  top: "concat4b2out0_1_2_3"
}
layer {
  name: "res4b2_branch2c"
  type: "Convolution"
  bottom: "concat4b2out0_1_2_3"
  top: "res4b2_branch2c"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn4b2_branch2c"
  type: "BatchNorm"
  bottom: "res4b2_branch2c"
  top: "res4b2_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b2_branch2c"
  type: "Scale"
  bottom: "res4b2_branch2c"
  top: "res4b2_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b2"
  type: "Eltwise"
  bottom: "res4b1"
  bottom: "res4b2_branch2c"
  top: "res4b2"
}
layer {
  name: "res4b2_relu"
  type: "ReLU"
  bottom: "res4b2"
  top: "res4b2"
}
layer {
  name: "res4b3_branch2a"
  type: "Convolution"
  bottom: "res4b2"
  top: "res4b3_branch2a"
  convolution_param {
    num_output: 416
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn4b3_branch2a"
  type: "BatchNorm"
  bottom: "res4b3_branch2a"
  top: "res4b3_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b3_branch2a"
  type: "Scale"
  bottom: "res4b3_branch2a"
  top: "res4b3_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b3_branch2a_relu"
  type: "ReLU"
  bottom: "res4b3_branch2a"
  top: "res4b3_branch2a"
}
layer {
  name: "slice4b3"
  type: "Slice"
  bottom: "res4b3_branch2a"
  top: "res4b3_branch2b_sp0"
  top: "res4b3_branch2b_sp1"
  top: "res4b3_branch2b_sp2"
  top: "res4b3_branch2b_sp3"
  slice_param {
    slice_dim: 1
    slice_point: 104
    slice_point: 208
    slice_point: 312
  }
}
layer {
  name: "res4b3_branch2b1"
  type: "Convolution"
  bottom: "res4b3_branch2b_sp0"
  top: "res4b3_branch2b1"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4b3_branch2b1"
  type: "BatchNorm"
  bottom: "res4b3_branch2b1"
  top: "res4b3_branch2b1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b3_branch2b1"
  type: "Scale"
  bottom: "res4b3_branch2b1"
  top: "res4b3_branch2b1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b3_branch2b1_relu"
  type: "ReLU"
  bottom: "res4b3_branch2b1"
  top: "res4b3_branch2b1"
}
layer {
  name: "res4b3_branch2b_sp0_1"
  type: "Eltwise"
  bottom: "res4b3_branch2b1"
  bottom: "res4b3_branch2b_sp1"
  top: "res4b3_branch2b_sp0_1"
}
layer {
  name: "res4b3_branch2b2"
  type: "Convolution"
  bottom: "res4b3_branch2b_sp0_1"
  top: "res4b3_branch2b2"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4b3_branch2b2"
  type: "BatchNorm"
  bottom: "res4b3_branch2b2"
  top: "res4b3_branch2b2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b3_branch2b2"
  type: "Scale"
  bottom: "res4b3_branch2b2"
  top: "res4b3_branch2b2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b3_branch2b2_relu"
  type: "ReLU"
  bottom: "res4b3_branch2b2"
  top: "res4b3_branch2b2"
}
layer {
  name: "concat4b3out0_1"
  type: "Concat"
  bottom: "res4b3_branch2b1"
  bottom: "res4b3_branch2b2"
  top: "concat4b3out0_1"
}
layer {
  name: "res4b3_branch2b_sp0_1_2"
  type: "Eltwise"
  bottom: "res4b3_branch2b2"
  bottom: "res4b3_branch2b_sp2"
  top: "res4b3_branch2b_sp0_1_2"
}
layer {
  name: "res4b3_branch2b3"
  type: "Convolution"
  bottom: "res4b3_branch2b_sp0_1_2"
  top: "res4b3_branch2b3"
  convolution_param {
    num_output: 104
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn4b3_branch2b3"
  type: "BatchNorm"
  bottom: "res4b3_branch2b3"
  top: "res4b3_branch2b3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b3_branch2b3"
  type: "Scale"
  bottom: "res4b3_branch2b3"
  top: "res4b3_branch2b3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b3_branch2b3_relu"
  type: "ReLU"
  bottom: "res4b3_branch2b3"
  top: "res4b3_branch2b3"
}
layer {
  name: "concat4b3out0_1_2"
  type: "Concat"
  bottom: "concat4b3out0_1"
  bottom: "res4b3_branch2b3"
  top: "concat4b3out0_1_2"
}
layer {
  name: "concat4b3out0_1_2_3"
  type: "Concat"
  bottom: "concat4b3out0_1_2"
  bottom: "res4b3_branch2b_sp3"
  top: "concat4b3out0_1_2_3"
}
layer {
  name: "res4b3_branch2c"
  type: "Convolution"
  bottom: "concat4b3out0_1_2_3"
  top: "res4b3_branch2c"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn4b3_branch2c"
  type: "BatchNorm"
  bottom: "res4b3_branch2c"
  top: "res4b3_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b3_branch2c"
  type: "Scale"
  bottom: "res4b3_branch2c"
  top: "res4b3_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b3"
  type: "Eltwise"
  bottom: "res4b2"
  bottom: "res4b3_branch2c"
  top: "res4b3"
}
layer {
  name: "res4b3_relu"
  type: "ReLU"
  bottom: "res4b3"
  top: "res4b3"
}
layer {
  name: "res4b4_branch2a"
  type: "Convolution"
  bottom: "res4b3"
  top: "res4b4_branch2a"
  convolution_param {
    num_output: 416
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn4b4_branch2a"
  type: "BatchNorm"
  bottom: "res4b4_branch2a"
  top: "res4b4_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale4b4_branch2a"
  type: "Scale"
